pandas assignment

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [4]:
df['FlightNumber'][1,3] = 10055,10075

E:\python\conda\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
E:\python\conda\lib\site-packages\pandas\core\indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)

In [5]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [6]:
type(df['FlightNumber'].astype(int))

pandas.core.series.Series

In [7]:
type(df['FlightNumber'][1])

numpy.float64

# question 1

In [8]:
df['FlightNumber'] = df['FlightNumber'].astype(int)

In [9]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [10]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

# question 2

In [11]:
new = pd.DataFrame({'From' : ['LoNDon', 'MAdrid','londON','Budapest', 'Brussels'],
                     'to'  : ['paris','miLAN','StockhOlm','paRis','londOn'],             
             'FlightNumber': [10045, 10055, 10065, 10075, 10085],
            'RecentDelays' : [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                'Airline'  : ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [12]:
new

       From         to  FlightNumber  RecentDelays              Airline
0    LoNDon      paris         10045      [23, 47]               KLM(!)
1    MAdrid      miLAN         10055            []    <Air France> (12)
2    londON  StockhOlm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      paRis         10075          [13]       12. Air France
4  Brussels     londOn         10085      [67, 32]          "Swiss Air"

# Question 3

In [13]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [14]:
df['From_To'] =df['From_To'].str.lower()

In [15]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      london_paris         10045      [23, 47]               KLM(!)
1      madrid_milan         10055            []    <Air France> (12)
2  london_stockholm         10065  [24, 43, 87]  (British Airways. )
3    budapest_paris         10075          [13]       12. Air France
4   brussels_london         10085      [67, 32]          "Swiss Air"

In [16]:
df['From_To'][0] = 'London_Paris'
df['From_To'][1] =  'Madrid_Milan'
df['From_To'][2] =  ' London_Stockholm'
df['From_To'][3] =  ' Budapest_Paris'
df['From_To'][4] =  'Brussels_London'

E:\python\conda\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
E:\python\conda\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

E:\python\conda\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until
E:\python\conda\lib\site-packages\ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.
E:\python\conda\lib\site-packages\ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """

In [17]:
df

             From_To  FlightNumber  RecentDelays              Airline
0       London_Paris         10045      [23, 47]               KLM(!)
1       Madrid_Milan         10055            []    <Air France> (12)
2   London_Stockholm         10065  [24, 43, 87]  (British Airways. )
3     Budapest_Paris         10075          [13]       12. Air France
4    Brussels_London         10085      [67, 32]          "Swiss Air"

In [18]:
new

       From         to  FlightNumber  RecentDelays              Airline
0    LoNDon      paris         10045      [23, 47]               KLM(!)
1    MAdrid      miLAN         10055            []    <Air France> (12)
2    londON  StockhOlm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      paRis         10075          [13]       12. Air France
4  Brussels     londOn         10085      [67, 32]          "Swiss Air"

In [19]:
new['From'][1] = 'Madrid'

E:\python\conda\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [20]:
new['From'][0] = 'London'

E:\python\conda\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [21]:
new

       From         to  FlightNumber  RecentDelays              Airline
0    London      paris         10045      [23, 47]               KLM(!)
1    Madrid      miLAN         10055            []    <Air France> (12)
2    londON  StockhOlm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      paRis         10075          [13]       12. Air France
4  Brussels     londOn         10085      [67, 32]          "Swiss Air"

In [22]:
new['From'][2] =  ' London'
new['From'][3] =  ' Budapest'
new['From'][4] =  'Brussels'

E:\python\conda\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
E:\python\conda\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

E:\python\conda\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [23]:
new

        From         to  FlightNumber  RecentDelays              Airline
0     London      paris         10045      [23, 47]               KLM(!)
1     Madrid      miLAN         10055            []    <Air France> (12)
2     London  StockhOlm         10065  [24, 43, 87]  (British Airways. )
3   Budapest      paRis         10075          [13]       12. Air France
4   Brussels     londOn         10085      [67, 32]          "Swiss Air"

In [24]:

new['to'][0] = 'Paris'

E:\python\conda\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [25]:
new['to'][1] =  'Milan'
new['to'][2] =  ' Stockholm'
new['to'][3] =  ' Paris'
new['to'][4] =  'London'

E:\python\conda\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
E:\python\conda\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

E:\python\conda\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until
E:\python\conda\lib\site-packages\ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.

In [26]:
new

        From          to  FlightNumber  RecentDelays              Airline
0     London       Paris         10045      [23, 47]               KLM(!)
1     Madrid       Milan         10055            []    <Air France> (12)
2     London   Stockholm         10065  [24, 43, 87]  (British Airways. )
3   Budapest       Paris         10075          [13]       12. Air France
4   Brussels      London         10085      [67, 32]          "Swiss Air"

# question 4

In [27]:
df

             From_To  FlightNumber  RecentDelays              Airline
0       London_Paris         10045      [23, 47]               KLM(!)
1       Madrid_Milan         10055            []    <Air France> (12)
2   London_Stockholm         10065  [24, 43, 87]  (British Airways. )
3     Budapest_Paris         10075          [13]       12. Air France
4    Brussels_London         10085      [67, 32]          "Swiss Air"

In [42]:
df = df.drop(['From_To'],axis = 1)

In [43]:
df['From'] = new['From']
df['To'] = new['to']

In [44]:
df

   FlightNumber  RecentDelays              Airline       From          To
0         10045      [23, 47]               KLM(!)     London       Paris
1         10055            []    <Air France> (12)     Madrid       Milan
2         10065  [24, 43, 87]  (British Airways. )     London   Stockholm
3         10075          [13]       12. Air France   Budapest       Paris
4         10085      [67, 32]          "Swiss Air"   Brussels      London

# Question 5

5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each

second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.

In [47]:
df['RecentDelays'][1] = 'nan'

E:\python\conda\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [48]:
df

   FlightNumber  RecentDelays              Airline       From          To
0         10045      [23, 47]               KLM(!)     London       Paris
1         10055           nan    <Air France> (12)     Madrid       Milan
2         10065  [24, 43, 87]  (British Airways. )     London   Stockholm
3         10075          [13]       12. Air France   Budapest       Paris
4         10085      [67, 32]          "Swiss Air"   Brussels      London

# Question 6

Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

In [52]:
delays = pd.DataFrame({ 'delay1': [23,24,13,67],
                      'delay2'  : [47,43,32,'nan'],
                      'delays'  : [87,'nan','nan','nan']})

In [53]:
delays

   delay1 delay2 delays
0      23     47     87
1      24     43    nan
2      13     32    nan
3      67    nan    nan